plat-portal-api/app/payments/tests/fake_data/app_transit_coupon/webhook_invoice.paid_end_trialing.json

{
  "type": "invoice.paid",
  "data": {
    "object": {
      "id": "in_1IsjoPBhZLR2oJFVM537oI4p",
      "tax": null,
      "paid": true,
      "lines": {
        "url": "/v1/invoices/in_1IsjoPBhZLR2oJFVM537oI4p/lines",
        "data": [
          {
            "id": "il_1IsjoPBhZLR2oJFV5w4GTT16",
            "plan": {
              "id": "price_1IVtKaBhZLR2oJFVWIp0mFIz",
              "active": true,
              "amount": 3500,
              "object": "plan",
              "created": 1615964292,
              "product": "prod_J89dTICrDhl4mk",
              "currency": "usd",
              "interval": "month",
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "tiers_mode": null,
              "usage_type": "licensed",
              "amount_decimal": "3500",
              "billing_scheme": "per_unit",
              "interval_count": 1,
              "aggregate_usage": null,
              "transform_usage": null,
              "trial_period_days": null
            },
            "type": "subscription",
            "price": {
              "id": "price_1IVtKaBhZLR2oJFVWIp0mFIz",
              "type": "recurring",
              "active": true,
              "object": "price",
              "created": 1615964292,
              "product": "prod_J89dTICrDhl4mk",
              "currency": "usd",
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "recurring": {
                "interval": "month",
                "usage_type": "licensed",
                "interval_count": 1,
                "aggregate_usage": null,
                "trial_period_days": null
              },
              "lookup_key": null,
              "tiers_mode": null,
              "unit_amount": 3500,
              "billing_scheme": "per_unit",
              "transform_quantity": null,
              "unit_amount_decimal": "3500"
            },
            "amount": 0,
            "object": "line_item",
            "period": {
              "end": 1621582045,
              "start": 1621409245
            },
            "currency": "usd",
            "livemode": false,
            "metadata": {},
            "quantity": 1,
            "discounts": [],
            "proration": false,
            "tax_rates": [],
            "description": "Trial period for CBPO STANDARD",
            "tax_amounts": [],
            "discountable": true,
            "subscription": "sub_JVlLUGrbIYs6Qr",
            "discount_amounts": [],
            "subscription_item": "si_JVlL4LcWR94eVo"
          }
        ],
        "object": "list",
        "has_more": false,
        "total_count": 1
      },
      "total": 0,
      "charge": null,
      "footer": null,
      "number": "FBF3E6CE-0001",
      "object": "invoice",
      "status": "paid",
      "created": 1621409245,
      "currency": "usd",
      "customer": "cus_JVlKfTTbouUsG8",
      "discount": {
        "id": "di_1M79iPBhZLR2oJFVylfT4tf3",
        "end": null,
        "start": 1669174417,
        "coupon": {
          "id": "TEGkiX9j",
          "name": "first coupon",
          "valid": true,
          "object": "coupon",
          "created": 1635494636,
          "currency": "usd",
          "duration": "once",
          "livemode": false,
          "metadata": {},
          "redeem_by": null,
          "amount_off": 1000,
          "percent_off": null,
          "times_redeemed": 43,
          "max_redemptions": null,
          "duration_in_months": null
        },
        "object": "discount",
        "invoice": null,
        "customer": "cus_KOpIurlaccYM3k",
        "invoice_item": null,
        "subscription": "sub_JRjzP3sflZEPJZ",
        "promotion_code": "promo_1M1RffBhZLR2oJFVxkcyNFFJ",
        "checkout_session": null
      },
      "due_date": null,
      "livemode": false,
      "metadata": {},
      "subtotal": 0,
      "attempted": true,
      "discounts": [
        "di_1M79iPBhZLR2oJFVylfT4tf3"
      ],
      "amount_due": 0,
      "period_end": 1621409245,
      "amount_paid": 0,
      "description": null,
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1IVAuQBhZLR2oJFV/invst_JVlL7GioroDECPPS91mgyLe9EXaUcoZ/pdf",
      "account_name": "CBPO QA",
      "auto_advance": false,
      "on_behalf_of": null,
      "period_start": 1621409245,
      "subscription": "sub_JRjzP3sflZEPJZ",
      "attempt_count": 0,
      "custom_fields": null,
      "customer_name": "Khanh Vu",
      "transfer_data": null,
      "billing_reason": "subscription_create",
      "customer_email": "vnhd1@example.com",
      "customer_phone": null,
      "default_source": null,
      "ending_balance": 0,
      "payment_intent": null,
      "receipt_number": null,
      "account_country": "US",
      "account_tax_ids": null,
      "amount_remaining": 0,
      "customer_address": null,
      "customer_tax_ids": [],
      "payment_settings": {
        "payment_method_types": null,
        "payment_method_options": null
      },
      "starting_balance": 0,
      "collection_method": "charge_automatically",
      "customer_shipping": null,
      "default_tax_rates": [],
      "total_tax_amounts": [],
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1IVAuQBhZLR2oJFV/invst_JVlL7GioroDECPPS91mgyLe9EXaUcoZ",
      "status_transitions": {
        "paid_at": 1621409246,
        "voided_at": null,
        "finalized_at": 1621409246,
        "marked_uncollectible_at": null
      },
      "customer_tax_exempt": "none",
      "next_payment_attempt": null,
      "statement_descriptor": null,
      "webhooks_delivered_at": 1621409252,
      "application_fee_amount": null,
      "default_payment_method": null,
      "total_discount_amounts": [
        {
          "amount": 1000,
          "discount": "di_1M79iPBhZLR2oJFVylfT4tf3"
        }
      ],
      "last_finalization_error": null,
      "pre_payment_credit_notes_amount": 0,
      "post_payment_credit_notes_amount": 0
    }
  }
}